; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_34)

(:domain logistics)

(:objects
	obj0 obj2 - airport
	obj1 obj3 - city
	obj4 obj5 - truck
	obj6 obj7 obj11 obj12 obj14 obj15 - package
	obj8 obj9 obj10 - location
	obj13 obj16 - airplane
)

(:init
	(at obj4 obj0)
	(at obj5 obj2)
	(at obj6 obj0)
	(at obj7 obj2)
	(at obj11 obj2)
	(at obj12 obj0)
	(at obj13 obj2)
	(at obj14 obj0)
	(at obj15 obj2)
	(at obj16 obj2)
	(in-city obj0 obj1)
	(in-city obj2 obj3)
	(in-city obj8 obj1)
	(in-city obj9 obj1)
	(in-city obj10 obj3)
)

(:goal (and
	(at obj6 obj10)
	(at obj7 obj8)
	(at obj11 obj9)
	(at obj12 obj10)
	(at obj14 obj10)
	(at obj15 obj8)
))
)

; plan
1. (drive obj4 obj0 obj8)
   deleted: (at obj4 obj0)
   added: (at obj4 obj8)
   goals met: 0 of 6
2. (drive obj5 obj2 obj10)
   deleted: (at obj5 obj2)
   added: (at obj5 obj10)
   goals met: 0 of 6
3. (load obj13 obj11 obj2)
   deleted: (at obj11 obj2)
   added: (in obj11 obj13)
   goals met: 0 of 6
4. (load obj13 obj15 obj2)
   deleted: (at obj15 obj2)
   added: (in obj15 obj13)
   goals met: 0 of 6
5. (load obj13 obj7 obj2)
   deleted: (at obj7 obj2)
   added: (in obj7 obj13)
   goals met: 0 of 6
6. (fly obj13 obj2 obj0)
   deleted: (at obj13 obj2)
   added: (at obj13 obj0)
   goals met: 0 of 6
7. (drive obj4 obj8 obj0)
   deleted: (at obj4 obj8)
   added: (at obj4 obj0)
   goals met: 0 of 6
8. (drive obj5 obj10 obj2)
   deleted: (at obj5 obj10)
   added: (at obj5 obj2)
   goals met: 0 of 6
9. (load obj13 obj12 obj0)
   deleted: (at obj12 obj0)
   added: (in obj12 obj13)
   goals met: 0 of 6
10. (load obj13 obj14 obj0)
   deleted: (at obj14 obj0)
   added: (in obj14 obj13)
   goals met: 0 of 6
11. (load obj13 obj6 obj0)
   deleted: (at obj6 obj0)
   added: (in obj6 obj13)
   goals met: 0 of 6
12. (unload obj13 obj11 obj0)
   deleted: (in obj11 obj13)
   added: (at obj11 obj0)
   goals met: 0 of 6
13. (unload obj13 obj15 obj0)
   deleted: (in obj15 obj13)
   added: (at obj15 obj0)
   goals met: 0 of 6
14. (unload obj13 obj7 obj0)
   deleted: (in obj7 obj13)
   added: (at obj7 obj0)
   goals met: 0 of 6
15. (fly obj13 obj0 obj2)
   deleted: (at obj13 obj0)
   added: (at obj13 obj2)
   goals met: 0 of 6
16. (fly obj16 obj2 obj0)
   deleted: (at obj16 obj2)
   added: (at obj16 obj0)
   goals met: 0 of 6
17. (load obj4 obj11 obj0)
   deleted: (at obj11 obj0)
   added: (in obj11 obj4)
   goals met: 0 of 6
18. (load obj4 obj15 obj0)
   deleted: (at obj15 obj0)
   added: (in obj15 obj4)
   goals met: 0 of 6
19. (load obj4 obj7 obj0)
   deleted: (at obj7 obj0)
   added: (in obj7 obj4)
   goals met: 0 of 6
20. (unload obj13 obj12 obj2)
   deleted: (in obj12 obj13)
   added: (at obj12 obj2)
   goals met: 0 of 6
21. (unload obj13 obj14 obj2)
   deleted: (in obj14 obj13)
   added: (at obj14 obj2)
   goals met: 0 of 6
22. (unload obj13 obj6 obj2)
   deleted: (in obj6 obj13)
   added: (at obj6 obj2)
   goals met: 0 of 6
23. (drive obj4 obj0 obj8)
   deleted: (at obj4 obj0)
   added: (at obj4 obj8)
   goals met: 0 of 6
24. (load obj5 obj12 obj2)
   deleted: (at obj12 obj2)
   added: (in obj12 obj5)
   goals met: 0 of 6
25. (load obj5 obj14 obj2)
   deleted: (at obj14 obj2)
   added: (in obj14 obj5)
   goals met: 0 of 6
26. (load obj5 obj6 obj2)
   deleted: (at obj6 obj2)
   added: (in obj6 obj5)
   goals met: 0 of 6
27. (unload obj4 obj15 obj8)
   deleted: (in obj15 obj4)
   added: (at obj15 obj8)
   goals met: 1 of 6
28. (unload obj4 obj7 obj8)
   deleted: (in obj7 obj4)
   added: (at obj7 obj8)
   goals met: 2 of 6
29. (drive obj4 obj8 obj9)
   deleted: (at obj4 obj8)
   added: (at obj4 obj9)
   goals met: 2 of 6
30. (drive obj5 obj2 obj10)
   deleted: (at obj5 obj2)
   added: (at obj5 obj10)
   goals met: 2 of 6
31. (fly obj13 obj2 obj0)
   deleted: (at obj13 obj2)
   added: (at obj13 obj0)
   goals met: 2 of 6
32. (fly obj16 obj0 obj2)
   deleted: (at obj16 obj0)
   added: (at obj16 obj2)
   goals met: 2 of 6
33. (unload obj4 obj11 obj9)
   deleted: (in obj11 obj4)
   added: (at obj11 obj9)
   goals met: 3 of 6
34. (unload obj5 obj12 obj10)
   deleted: (in obj12 obj5)
   added: (at obj12 obj10)
   goals met: 4 of 6
35. (unload obj5 obj14 obj10)
   deleted: (in obj14 obj5)
   added: (at obj14 obj10)
   goals met: 5 of 6
36. (unload obj5 obj6 obj10)
   deleted: (in obj6 obj5)
   added: (at obj6 obj10)
   goals met: 6 of 6
